[A_Coordination_Buff H7BaseBuff]
mName="致命协调"
mTooltip=""

[A_hide_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_Coordination_CreatureAbility H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_DeadAngle_Buff H7BaseBuff]
mName="危险死角"
mTooltip=""



[A_DeadAngle_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="危险死角"
mTooltip="敌方生物在被友方生物全力侧击时，会以 %spell1.spell.buff1.buff.stat %ICON_ATTACK 攻击进行反击。"

[A_Coordination_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="致命协调"
mTooltip="如果友方生物的首次近战攻击未被反击，它会立即对同一目标进行第二次免费攻击（每战斗回合一次）。"

[A_Hide_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="销声匿迹"
mTooltip="友方生物如果在本战斗回合未受到伤害，则在战斗回合结束时获得潜行。"

[A_DeadAngle_CreatureAbility H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_MephiticScent_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="剧毒香气"
mTooltip="带有潜行的友方生物在穿过敌方生物时，对队伍中的每个单独生物造成 %buff.buff.d.min %ICON_DARK 暗系伤害。"


[A_WeakSpot_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="可乘之隙"
mTooltip="敌方生物队伍在受到近战攻击后获得 %spell1.spell.buff.buff.stat2 %ICON_ATTACK 攻击和 %spell1.spell.buff.buff.stat1 %ICON_DEFENSE 防御。持续到战斗回合结束。"

[A_WeakSpot_Buff H7BaseBuff]
mName="可乘之隙"
mTooltip="%stat2 %ICON_ATTACK 攻击\n%stat1 %ICON_DEFENSE 防御\n持续到战斗回合结束。"

[A_WeakSpot_CreatureAbility H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_ShroudOfMalassa_Shrouded_Buff_GuaranteedCrit H7BaseBuff]
mName="潜行"

UCP MOD

[A_Confusion_Buff H7BaseBuff]
mName="意识模糊"
mTooltip="该生物无法反击。\n持续到当前激活生物的回合结束。\n（不受影响：亡灵和构造体）"

[A_Confusion_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="意识模糊"
mTooltip="英雄的攻击额外压制目标敌方生物的反击，直到当前激活生物的回合结束。\n（不受影响：亡灵和构造体）"

UCP 1.1



[A_ShroudOfMalassa_Shrouded_Buff H7BaseBuff]
mName="潜行"
mTooltip="该生物可以穿过任何其他生物。持续到该生物攻击为止。"

[A_ShroudOfMalassa_Shrouded_Buff_1_Novice H7BaseBuff]
mName="潜行"
mTooltip="该生物可以穿过任何其他生物。持续到该生物攻击为止。"

[A_ShroudOfMalassa_Shrouded_Buff_2_Expert H7BaseBuff]
mName="潜行"
mTooltip="该生物可以穿过任何其他生物，并拥有 %stat1 %ICON_MAX_MOVEMENT 移动力。持续到该生物攻击为止。"

[A_ShroudOfMalassa_Shrouded_Buff_3_Master H7BaseBuff]
mName="潜行"
mTooltip="该生物可以穿过任何其他生物，并拥有 %stat1 %ICON_MAX_MOVEMENT 移动力。持续到该生物攻击为止（该生物在攻击时获得额外的 %special3.val1 %ICON_ATTACK 攻击和 %special5.val1 %ICON_LUCK 幸运）。"


H7.5_mod v2

[A_ShroudOfMalassa_Skill H7Skill]
mDescriptions[0]="友方生物进入潜行状态，以很好地准备其首次攻击并削弱敌方生物。"
mDescriptions[1]=""
mDescriptions[2]="所有友方生物在战斗开始时处于潜行状态。潜行允许生物穿过任何其他生物。潜行在生物攻击后结束。"
mDescriptions[3]="潜行生物拥有 %buff2.buff.stat1 %ICON_MAX_MOVEMENT 移动力。"
mDescriptions[4]="潜行生物在攻击时获得 %buff3.buff.special3.val1 %ICON_ATTACK 攻击和 %buff3.buff.special5.val1 %ICON_LUCK 幸运。"
mName="暗龙之蔽"
mTooltip="地牢阵营技能。"

version 1.35 :

[A_SmokeBomb_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="烟幕爆破"
mTooltip="当友方生物失去潜行时，所有相邻的敌方生物获得 %buff.buff.stat %ICON_Defense 防御，直到下一战斗回合结束。"

[A_SmokeBomb_Buff H7BaseBuff]
mName="烟幕爆破"
mTooltip="%stat %ICON_Defense 防御。\n持续 %durnow 战斗回合。"